package common

import (
	"testing"
	"log"
)

func TestS위험관리_검토결과(테스트 *testing.T) {
	통과 := true
	수량조정_필요 := false
	수량 := int64(0)
	금액조정_필요 := true
	금액 := float64(100.005)
	매개변수_모음 := new(S매개변수_모음)
	매개변수_모음.S추가("정수", int(3))
	매개변수_모음.S추가("실수", float64(3.3))
	매개변수_모음.S추가("문자열", "three")

	검토_결과 := F위험관리_검토결과_생성(
				통과, 수량조정_필요, 수량, 금액조정_필요, 금액, 매개변수_모음)
				
	정수, _ := 검토_결과.G가변형("정수").G정수()
	실수, _ := 검토_결과.G가변형("실수").G실수64()
	문자열, _ := 검토_결과.G가변형("문자열").G문자열()
	
	if !검토_결과.G통과() ||
		검토_결과.G수량조정_필요() ||
		검토_결과.G수량() != 0 ||
		!검토_결과.G금액조정_필요() ||
		검토_결과.G금액() != 100.01 ||
		검토_결과.G값("정수").(int) != 3 ||
		검토_결과.G값("실수").(float64) != 3.3 ||
		검토_결과.G값("문자열").(string) != "three" ||
		정수 != 3 ||
		실수 != 3.3 ||
		문자열 != "three" {
		log.Printf("통과 : 예상값 true, 실제값 %v.", 검토_결과.G통과())
		log.Printf("수량조정 필요 : 예상값 false, 실제값 %v.", 검토_결과.G수량조정_필요())
		log.Printf("수량 : 예상값 0, 실제값 %v.", 검토_결과.G수량())
		log.Printf("금액조정 필요 : 예상값 true, 실제값 %v.", 검토_결과.G금액조정_필요())
		log.Printf("금액 : 예상값 100.0, 실제값 %v.", 검토_결과.G금액())
		log.Printf("G값('정수').(int) : 예상값 3, 실제값 %v.", 검토_결과.G값("정수").(int))
		log.Printf("G값('실수').(float64) : 예상값 3.3, 실제값 %v.", 검토_결과.G값("실수").(float64))
		log.Printf("G값('문자열').(string) : 예상값 'three', 실제값 %v.", 검토_결과.G값("문자열").(string))
		log.Printf("정수 : 예상값 3, 실제값 %v.", 정수)
		log.Printf("실수 : 예상값 3.3, 실제값 %v.", 실수)
		log.Printf("문자열 : 예상값 'three', 실제값 %v.", 문자열)
		
		테스트.Error("common.TestS위험관리_검토결과() : 검토 결과 불일치.")
	}
}